app/views/task/show.html.erb

                    <div id="task_taskdue">
    						    	<%sender = User.find(taskdo.sender)%>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1

  				    		<div class="col-md-3">
  									<% @commentdo = Comment.where(:task_id => taskdo.id) %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`task_id` = 2

                <aside>
                  <% taskdo.users.each do |doer| %>
---
SELECT `users`.* FROM `users` INNER JOIN `tasks_users` ON `users`.`id` = `tasks_users`.`user_id` WHERE `tasks_users`.`task_id` = 2