app/views/chat/show.html.erb

SELECT `tasks`.* FROM `tasks` INNER JOIN `tasks_users` ON `tasks`.`id` = `tasks_users`.`task_id` WHERE `tasks_users`.`user_id` = 2 AND `tasks`.`team_id` = 2  ORDER BY `tasks`.`duedate` ASC
---

        <% current_user.tasks.where(:team_id => @team.id).order(duedate: :asc).each_with_index do |b,i| %>